PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p18lf24k50.inc
;----- CONFIG1H Options --------------------------------------------------
_FOSC_LP_1H          EQU  H'F0'    ; LP oscillator
_FOSC_XT_1H          EQU  H'F1'    ; XT oscillator
_FOSC_HSH_1H         EQU  H'F2'    ; HS oscillator, high power 16MHz to 25MHz
_FOSC_HSM_1H         EQU  H'F3'    ; HS oscillator, medium power 4MHz to 16MHz
_FOSC_ECHCLKO_1H     EQU  H'F4'    ; EC oscillator, high power 16MHz to 48MHz, clock output on OSC2
_FOSC_ECHIO_1H       EQU  H'F5'    ; EC oscillator, high power 16MHz to 48MHz
_FOSC_RCCLKO_1H      EQU  H'F6'    ; External RC oscillator, clock output on OSC2
_FOSC_RCIO_1H        EQU  H'F7'    ; External RC oscillator
_FOSC_INTOSCIO_1H    EQU  H'F8'    ; Internal oscillator
_FOSC_INTOSCCLKO_1H  EQU  H'F9'    ; Internal oscillator, clock output on OSC2
_FOSC_ECMCLKO_1H     EQU  H'FA'    ; EC oscillator, medium power 4MHz to 16MHz, clock output on OSC2
_FOSC_ECMIO_1H       EQU  H'FB'    ; EC oscillator, medium power 4MHz to 16MHz
_FOSC_ECLCLKO_1H     EQU  H'FC'    ; EC oscillator, low power <4MHz, clock output on OSC2
_FOSC_ECLIO_1H       EQU  H'FD'    ; EC oscillator, low power <4MHz

_PCLKEN_OFF_1H       EQU  H'DF'    ; Primary oscillator shutdown firmware controlled
_PCLKEN_ON_1H        EQU  H'FF'    ; Primary oscillator enabled

_FCMEN_OFF_1H        EQU  H'BF'    ; Fail-Safe Clock Monitor disabled
_FCMEN_ON_1H         EQU  H'FF'    ; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'    ; Oscillator Switchover mode disabled
_IESO_ON_1H          EQU  H'FF'    ; Oscillator Switchover mode enabled

;----- CONFIG2L Options --------------------------------------------------
_nPWRTEN_ON_2L       EQU  H'FE'    ; Power up timer enabled
_nPWRTEN_OFF_2L      EQU  H'FF'    ; Power up timer disabled

_BOREN_OFF_2L        EQU  H'F9'    ; BOR disabled in hardware (SBOREN is ignored)
_BOREN_ON_2L         EQU  H'FB'    ; BOR controlled by firmware (SBOREN is enabled)
_BOREN_NOSLP_2L      EQU  H'FD'    ; BOR enabled in hardware, disabled in Sleep mode (SBOREN is ignored)
_BOREN_SBORDIS_2L    EQU  H'FF'    ; BOR enabled in hardware (SBOREN is ignored)

_BORV_285_2L         EQU  H'E7'    ; BOR set to 2.85V nominal
_BORV_250_2L         EQU  H'EF'    ; BOR set to 2.5V nominal
_BORV_220_2L         EQU  H'F7'    ; BOR set to 2.2V nominal
_BORV_190_2L         EQU  H'FF'    ; BOR set to 1.9V nominal

_nLPBOR_ON_2L        EQU  H'BF'    ; Low-Power Brown-out Reset enabled
_nLPBOR_OFF_2L       EQU  H'FF'    ; Low-Power Brown-out Reset disabled

;----- CONFIG2H Options --------------------------------------------------
_WDTEN_OFF_2H        EQU  H'FC'    ; WDT disabled in hardware (SWDTEN ignored)
_WDTEN_NOSLP_2H      EQU  H'FD'    ; WDT enabled in hardware, disabled in Sleep mode (SWDTEN ignored)
_WDTEN_SWON_2H       EQU  H'FE'    ; WDT controlled by firmware (SWDTEN enabled)
_WDTEN_ON_2H         EQU  H'FF'    ; WDT enabled in hardware (SWDTEN ignored)

_WDTPS_1_2H          EQU  H'C3'    ; 1:1
_WDTPS_2_2H          EQU  H'C7'    ; 1:2
_WDTPS_4_2H          EQU  H'CB'    ; 1:4
_WDTPS_8_2H          EQU  H'CF'    ; 1:8
_WDTPS_16_2H         EQU  H'D3'    ; 1:16
_WDTPS_32_2H         EQU  H'D7'    ; 1:32
_WDTPS_64_2H         EQU  H'DB'    ; 1:64
_WDTPS_128_2H        EQU  H'DF'    ; 1:128
_WDTPS_256_2H        EQU  H'E3'    ; 1:256
_WDTPS_512_2H        EQU  H'E7'    ; 1:512
_WDTPS_1024_2H       EQU  H'EB'    ; 1:1024
_WDTPS_2048_2H       EQU  H'EF'    ; 1:2048
_WDTPS_4096_2H       EQU  H'F3'    ; 1:4096
_WDTPS_8192_2H       EQU  H'F7'    ; 1:8192
_WDTPS_16384_2H      EQU  H'FB'    ; 1:16384
_WDTPS_32768_2H      EQU  H'FF'    ; 1:32768

;----- CONFIG3H Options --------------------------------------------------
_CCP2MX_RB3_3H       EQU  H'FE'    ; CCP2 input/output is multiplexed with RB3
_CCP2MX_RC1_3H       EQU  H'FF'    ; CCP2 input/output is multiplexed with RC1

_PBADEN_OFF_3H       EQU  H'FD'    ; PORTB<5:0> pins are configured as digital I/O on Reset
_PBADEN_ON_3H        EQU  H'FF'    ; PORTB<5:0> pins are configured as analog input channels on Reset

_T3CMX_RB5_3H        EQU  H'EF'    ; T3CKI function is on RB5
_T3CMX_RC0_3H        EQU  H'FF'    ; T3CKI function is on RC0

_SDOMX_RC7_3H        EQU  H'BF'    ; SDO function is on RC7
_SDOMX_RB3_3H        EQU  H'FF'    ; SDO function is on RB3

_MCLRE_OFF_3H        EQU  H'7F'    ; RE3 input pin enabled; external MCLR disabled
_MCLRE_ON_3H         EQU  H'FF'    ; MCLR pin enabled; RE3 input disabled

;----- CONFIG4L Options --------------------------------------------------
_STVREN_OFF_4L       EQU  H'FE'    ; Stack full/underflow will not cause Reset
_STVREN_ON_4L        EQU  H'FF'    ; Stack full/underflow will cause Reset

_LVP_OFF_4L          EQU  H'FB'    ; Single-Supply ICSP disabled
_LVP_ON_4L           EQU  H'FF'    ; Single-Supply ICSP enabled if MCLRE is also 1

_ICPRT_OFF_4L        EQU  H'DF'    ; ICPORT disabled

_XINST_OFF_4L        EQU  H'BF'    ; Instruction set extension and Indexed Addressing mode disabled
_XINST_ON_4L         EQU  H'FF'    ; Instruction set extension and Indexed Addressing mode enabled

_DEBUG_ON_4L         EQU  H'7F'    ; Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug
_DEBUG_OFF_4L        EQU  H'FF'    ; Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'    ; Block 0 is code-protected
_CP0_OFF_5L          EQU  H'FF'    ; Block 0 is not code-protected

_CP1_ON_5L           EQU  H'FD'    ; Block 1 is code-protected
_CP1_OFF_5L          EQU  H'FF'    ; Block 1 is not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'    ; Boot block is code-protected
_CPB_OFF_5H          EQU  H'FF'    ; Boot block is not code-protected

_CPD_ON_5H           EQU  H'7F'    ; Data EEPROM is code-protected
_CPD_OFF_5H          EQU  H'FF'    ; Data EEPROM is not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'    ; Block 0 (0800-1FFFh) is write-protected
_WRT0_OFF_6L         EQU  H'FF'    ; Block 0 (0800-1FFFh) is not write-protected

_WRT1_ON_6L          EQU  H'FD'    ; Block 1 (2000-3FFFh) is write-protected
_WRT1_OFF_6L         EQU  H'FF'    ; Block 1 (2000-3FFFh) is not write-protected

